*** Arxiv version

I won't make another folder, just tar up the necessary files and hope for the best

#+begin_src sh :dir .
  grep 'Graphic file' ms.log | cut -d ' ' -f2 |xargs du -sk |sort -nr
#+end_src

#+RESULTS:
| 2112 | figs/turtle-lobes-simplified-components-lores.jpg      |
| 2112 | figs/oiii-propermotions-lores.jpg                      |
|  832 | figs/nii-propermotions-lores.jpg                       |
|  792 | figs/turtle-lobes-simplified-systems.pdf               |
|  768 | figs/turtle-overview.pdf                               |
|  768 | figs/turtle-halo-slit-x.pdf                            |
|  560 | figs/turtle-halo-map-lores.jpg                         |
|  532 | figs/cut-axis-4panel.pdf                               |
|  448 | figs/turtle-heii-shell-components.pdf                  |
|  364 | tere-figs/Figure3.pdf                                  |
|  364 | figs/turtle-nii-knot-complexes.pdf                     |
|  232 | figs/turtle-peanut-map-lores.jpg                       |
|  184 | figs/turtle-knot-complex-map-lores.jpg                 |
|  180 | figs/cousins-of-the-turtle-lores.pdf                   |
|  128 | figs/vel-radius-systems-annotated.pdf                  |
|  120 | figs/turtle-slits.pdf                                  |
|   76 | figs/turtle-knot-complexes-velocity-axes-annotated.pdf |
|   76 | figs/line-ratios-vs-ion-parameter.pdf                  |
|   68 | figs/turtle-heii-shell-annotated.pdf                   |
|   48 | figs/turtle-shell-velocity-axes-annotated.pdf          |
|   44 | figs/mass-loss-history-annotated.pdf                   |
|   44 | figs/hr-pne-annotated.pdf                              |
|   32 | figs/turtle-flow-axis-history.pdf                      |
|   32 | figs/turtle-density-profile.pdf                        |
|   32 | figs/turtle-density-calibration.pdf                    |
|   24 | figs/turtle-heii-shell-velocity-axes-annotated.pdf     |
|   24 | figs/turtle-1d-line-profiles.pdf                       |
|   20 | figs/turtle-inclination-histogram.pdf                  |


#+begin_src sh :results verbatim
  FIGFILES="figs/turtle-lobes-simplified-components-lores.jpg
  figs/oiii-propermotions-lores.jpg figs/nii-propermotions-lores.jpg
  figs/turtle-lobes-simplified-systems.pdf figs/turtle-overview.pdf
  figs/turtle-halo-slit-x.pdf figs/turtle-halo-map-lores.jpg
  figs/cut-axis-4panel.pdf figs/turtle-heii-shell-components.pdf
  tere-figs/Figure3.pdf figs/turtle-nii-knot-complexes.pdf
  figs/turtle-peanut-map-lores.jpg
  figs/turtle-knot-complex-map-lores.jpg
  figs/cousins-of-the-turtle-lores.pdf
  figs/vel-radius-systems-annotated.pdf figs/turtle-slits.pdf
  figs/turtle-knot-complexes-velocity-axes-annotated.pdf
  figs/line-ratios-vs-ion-parameter.pdf
  figs/turtle-heii-shell-annotated.pdf
  figs/turtle-shell-velocity-axes-annotated.pdf
  figs/mass-loss-history-annotated.pdf figs/hr-pne-annotated.pdf
  figs/turtle-flow-axis-history.pdf figs/turtle-density-profile.pdf
  figs/turtle-density-calibration.pdf
  figs/turtle-heii-shell-velocity-axes-annotated.pdf
  figs/turtle-1d-line-profiles.pdf figs/turtle-inclination-histogram.pdf"

  tar cvzf turtle-astro-ph.tgz ms.tex ms.bbl wjh-packages.sty $FIGFILES
#+end_src

#+RESULTS:

**** Script to check sizes

#+begin_src sh :dir production
  grep 'Graphic file' ms.log | cut -d ' ' -f2 |xargs du -sk |sort -nr
#+end_src

#+RESULTS:
| 6340 | ../figs/oiii-propermotions.jpg                            |
| 4312 | ../figs/cousins-of-the-turtle.pdf                         |
| 2704 | ../figs/nii-propermotions.jpg                             |
| 2112 | ../figs/turtle-lobes-simplified-components.pdf            |
| 2112 | ../figs/turtle-halo-map.pdf                               |
| 1024 | ../figs/turtle-knot-complex-map.pdf                       |
|  960 | ../figs/turtle-peanut-map.pdf                             |
|  792 | ../figs/turtle-lobes-simplified-systems.pdf               |
|  768 | ../figs/turtle-overview.pdf                               |
|  768 | ../figs/turtle-halo-slit-x.pdf                            |
|  532 | ../figs/cut-axis-4panel.pdf                               |
|  448 | ../figs/turtle-heii-shell-components.pdf                  |
|  364 | ../figs/turtle-nii-knot-complexes.pdf                     |
|  364 | ../figs/tere-figure.pdf                                   |
|  128 | ../figs/vel-radius-systems-annotated.pdf                  |
|  120 | ../figs/turtle-slits.pdf                                  |
|   76 | ../figs/turtle-knot-complexes-velocity-axes-annotated.pdf |
|   76 | ../figs/line-ratios-vs-ion-parameter.pdf                  |
|   68 | ../figs/turtle-heii-shell-annotated.pdf                   |
|   48 | ../figs/turtle-shell-velocity-axes-annotated.pdf          |
|   44 | ../figs/mass-loss-history-annotated.pdf                   |
|   44 | ../figs/hr-pne-annotated.pdf                              |
|   32 | ../figs/turtle-flow-axis-history.pdf                      |
|   32 | ../figs/turtle-density-profile.pdf                        |
|   32 | ../figs/turtle-density-calibration.pdf                    |
|   24 | ../figs/turtle-heii-shell-velocity-axes-annotated.pdf     |
|   24 | ../figs/turtle-1d-line-profiles.pdf                       |
|   20 | ../figs/turtle-inclination-histogram.pdf                  |
**** Copy all figures to the production folder
#+begin_src sh :dir production :results verbatim
  FILES=" ../figs/oiii-propermotions.jpg
  ../figs/cousins-of-the-turtle.pdf ../figs/nii-propermotions.jpg
  ../figs/turtle-lobes-simplified-components.pdf
  ../figs/turtle-halo-map.pdf ../figs/turtle-knot-complex-map.pdf
  ../figs/turtle-peanut-map.pdf
  ../figs/turtle-lobes-simplified-systems.pdf
  ../figs/turtle-overview.pdf ../figs/turtle-halo-slit-x.pdf
  ../figs/cut-axis-4panel.pdf ../figs/turtle-heii-shell-components.pdf
  ../figs/turtle-nii-knot-complexes.pdf ../figs/tere-figure.pdf
  ../figs/vel-radius-systems-annotated.pdf ../figs/turtle-slits.pdf
  ../figs/turtle-knot-complexes-velocity-axes-annotated.pdf
  ../figs/line-ratios-vs-ion-parameter.pdf
  ../figs/turtle-heii-shell-annotated.pdf
  ../figs/turtle-shell-velocity-axes-annotated.pdf
  ../figs/mass-loss-history-annotated.pdf ../figs/hr-pne-annotated.pdf
  ../figs/turtle-flow-axis-history.pdf
  ../figs/turtle-density-profile.pdf
  ../figs/turtle-density-calibration.pdf
  ../figs/turtle-heii-shell-velocity-axes-annotated.pdf
  ../figs/turtle-1d-line-profiles.pdf
  ../figs/turtle-inclination-histogram.pdf"
  mkdir -p figs
  for f in $FILES; do
      cp -v $f figs
  done
#+end_src

#+RESULTS:
#+begin_example
../figs/oiii-propermotions.jpg -> figs/oiii-propermotions.jpg
../figs/cousins-of-the-turtle.pdf -> figs/cousins-of-the-turtle.pdf
../figs/nii-propermotions.jpg -> figs/nii-propermotions.jpg
../figs/turtle-lobes-simplified-components.pdf -> figs/turtle-lobes-simplified-components.pdf
../figs/turtle-halo-map.pdf -> figs/turtle-halo-map.pdf
../figs/turtle-knot-complex-map.pdf -> figs/turtle-knot-complex-map.pdf
../figs/turtle-peanut-map.pdf -> figs/turtle-peanut-map.pdf
../figs/turtle-lobes-simplified-systems.pdf -> figs/turtle-lobes-simplified-systems.pdf
../figs/turtle-overview.pdf -> figs/turtle-overview.pdf
../figs/turtle-halo-slit-x.pdf -> figs/turtle-halo-slit-x.pdf
../figs/cut-axis-4panel.pdf -> figs/cut-axis-4panel.pdf
../figs/turtle-heii-shell-components.pdf -> figs/turtle-heii-shell-components.pdf
../figs/turtle-nii-knot-complexes.pdf -> figs/turtle-nii-knot-complexes.pdf
../figs/tere-figure.pdf -> figs/tere-figure.pdf
../figs/vel-radius-systems-annotated.pdf -> figs/vel-radius-systems-annotated.pdf
../figs/turtle-slits.pdf -> figs/turtle-slits.pdf
../figs/turtle-knot-complexes-velocity-axes-annotated.pdf -> figs/turtle-knot-complexes-velocity-axes-annotated.pdf
../figs/line-ratios-vs-ion-parameter.pdf -> figs/line-ratios-vs-ion-parameter.pdf
../figs/turtle-heii-shell-annotated.pdf -> figs/turtle-heii-shell-annotated.pdf
../figs/turtle-shell-velocity-axes-annotated.pdf -> figs/turtle-shell-velocity-axes-annotated.pdf
../figs/mass-loss-history-annotated.pdf -> figs/mass-loss-history-annotated.pdf
../figs/hr-pne-annotated.pdf -> figs/hr-pne-annotated.pdf
../figs/turtle-flow-axis-history.pdf -> figs/turtle-flow-axis-history.pdf
../figs/turtle-density-profile.pdf -> figs/turtle-density-profile.pdf
../figs/turtle-density-calibration.pdf -> figs/turtle-density-calibration.pdf
../figs/turtle-heii-shell-velocity-axes-annotated.pdf -> figs/turtle-heii-shell-velocity-axes-annotated.pdf
../figs/turtle-1d-line-profiles.pdf -> figs/turtle-1d-line-profiles.pdf
../figs/turtle-inclination-histogram.pdf -> figs/turtle-inclination-histogram.pdf
#+end_example
**** Getting the expanded versions of V1 and V2
+ I checked out the relevant commit to a temp directory: [[file:/tmp/turtle-paper-v1/]]
  #+begin_example
    (science) will@gris turtle-paper-v1 % git status
    HEAD detached at 4039321
  #+end_example
+ I latexed it to make the bbl file
+ Now, do latexpand to get everything in one file
  #+begin_src sh :dir /tmp/turtle-paper-v1
    latexpand ms.tex \
                --verbose --keep-comments --explain \
                --expand-bbl ms.bbl \
                --show-graphics \
                -o ms-v1-expand.tex
  #+end_src
+ Copy expanded version to here
  #+begin_src sh :results none
    mkdir -p latexdiff
    cp /tmp/turtle-paper-v1/ms-v1-expand.tex latexdiff
  #+end_src
+ And expand the current version
  #+begin_src sh :results silent
    latexpand ms.tex \
                --verbose --keep-comments --explain \
                --expand-bbl ms.bbl \
                --show-graphics \
                -o latexdiff/ms-v2-expand.tex
  #+end_src
+ And get the config file from the bow shock projects
  #+begin_src sh
    cp -v ~/Work/Bowshocks/Jorge/bowshock-shape/papers/bs-bw-dw-03-submit/latexdiff/wjh-latexdiff-preamble.tex latexdiff
  #+end_src

  #+RESULTS:
  : /Users/will/Work/Bowshocks/Jorge/bowshock-shape/papers/bs-bw-dw-03-submit/latexdiff/wjh-latexdiff-preamble.tex -> latexdiff/wjh-latexdiff-preamble.tex

**** Script to check sizes

#+begin_src sh
  grep 'Graphic file' ms.log | cut -d ' ' -f2 |xargs du -sk |sort -nr
#+end_src

#+RESULTS:
| 2112 | figs/turtle-lobes-simplified-components.pdf            |
| 2112 | figs/turtle-halo-map.pdf                               |
| 2112 | figs/oiii-propermotions-lores.jpg                      |
| 1024 | figs/turtle-knot-complex-map.pdf                       |
|  960 | figs/turtle-peanut-map.pdf                             |
|  832 | figs/nii-propermotions-lores.jpg                       |
|  792 | figs/turtle-lobes-simplified-systems.pdf               |
|  768 | figs/turtle-overview.pdf                               |
|  768 | figs/turtle-halo-slit-x.pdf                            |
|  532 | figs/cut-axis-4panel.pdf                               |
|  448 | figs/turtle-heii-shell-components.pdf                  |
|  364 | tere-figs/Figure3.pdf                                  |
|  364 | figs/turtle-nii-knot-complexes.pdf                     |
|  180 | figs/cousins-of-the-turtle-lores.pdf                   |
|  128 | figs/vel-radius-systems-annotated.pdf                  |
|  120 | figs/turtle-slits.pdf                                  |
|   76 | figs/turtle-knot-complexes-velocity-axes-annotated.pdf |
|   76 | figs/line-ratios-vs-ion-parameter.pdf                  |
|   68 | figs/turtle-heii-shell-annotated.pdf                   |
|   48 | figs/turtle-shell-velocity-axes-annotated.pdf          |
|   44 | figs/mass-loss-history-annotated.pdf                   |
|   44 | figs/hr-pne-annotated.pdf                              |
|   32 | figs/turtle-flow-axis-history.pdf                      |
|   32 | figs/turtle-density-profile.pdf                        |
|   32 | figs/turtle-density-calibration.pdf                    |
|   24 | figs/turtle-heii-shell-velocity-axes-annotated.pdf     |
|   24 | figs/turtle-1d-line-profiles.pdf                       |
|   20 | figs/turtle-inclination-histogram.pdf                  |

**** Find which figure files have associated .afdesign files and copy them into this project

+ /Do not run this script again/ like *EVER* - since it will overwrite the edited ~.afdesign~ files
#+begin_src sh :results verbatim :eval no
  files=$(grep 'Graphic file' ms.log | cut -d ' ' -f2 | grep "^figs/" | sed -e 's/-lores//' | cut -d '.' -f1)
  for f in $files; do
      if [[ -f ../Teresa-Turtle/$f.afdesign ]]; then
          # ls -l ../Teresa-Turtle/$f.afdesign
          cp -v ../Teresa-Turtle/$f.afdesign figs
      fi
  done
#+end_src

#+RESULTS:
#+begin_example
../Teresa-Turtle/figs/turtle-overview.afdesign -> figs/turtle-overview.afdesign
../Teresa-Turtle/figs/turtle-halo-slit-x.afdesign -> figs/turtle-halo-slit-x.afdesign
../Teresa-Turtle/figs/turtle-peanut-map.afdesign -> figs/turtle-peanut-map.afdesign
../Teresa-Turtle/figs/turtle-heii-shell-components.afdesign -> figs/turtle-heii-shell-components.afdesign
../Teresa-Turtle/figs/turtle-knot-complex-map.afdesign -> figs/turtle-knot-complex-map.afdesign
../Teresa-Turtle/figs/turtle-lobes-simplified-components.afdesign -> figs/turtle-lobes-simplified-components.afdesign
../Teresa-Turtle/figs/turtle-halo-map.afdesign -> figs/turtle-halo-map.afdesign
../Teresa-Turtle/figs/turtle-shell-velocity-axes-annotated.afdesign -> figs/turtle-shell-velocity-axes-annotated.afdesign
../Teresa-Turtle/figs/turtle-heii-shell-annotated.afdesign -> figs/turtle-heii-shell-annotated.afdesign
../Teresa-Turtle/figs/turtle-heii-shell-velocity-axes-annotated.afdesign -> figs/turtle-heii-shell-velocity-axes-annotated.afdesign
../Teresa-Turtle/figs/turtle-nii-knot-complexes.afdesign -> figs/turtle-nii-knot-complexes.afdesign
../Teresa-Turtle/figs/turtle-knot-complexes-velocity-axes-annotated.afdesign -> figs/turtle-knot-complexes-velocity-axes-annotated.afdesign
../Teresa-Turtle/figs/turtle-lobes-simplified-systems.afdesign -> figs/turtle-lobes-simplified-systems.afdesign
../Teresa-Turtle/figs/cut-axis-4panel.afdesign -> figs/cut-axis-4panel.afdesign
../Teresa-Turtle/figs/vel-radius-systems-annotated.afdesign -> figs/vel-radius-systems-annotated.afdesign
../Teresa-Turtle/figs/turtle-flow-axis-history.afdesign -> figs/turtle-flow-axis-history.afdesign
../Teresa-Turtle/figs/turtle-density-profile.afdesign -> figs/turtle-density-profile.afdesign
../Teresa-Turtle/figs/mass-loss-history-annotated.afdesign -> figs/mass-loss-history-annotated.afdesign
../Teresa-Turtle/figs/hr-pne-annotated.afdesign -> figs/hr-pne-annotated.afdesign
../Teresa-Turtle/figs/cousins-of-the-turtle.afdesign -> figs/cousins-of-the-turtle.afdesign
../Teresa-Turtle/figs/turtle-density-calibration.afdesign -> figs/turtle-density-calibration.afdesign
../Teresa-Turtle/figs/line-ratios-vs-ion-parameter.afdesign -> figs/line-ratios-vs-ion-parameter.afdesign
#+end_example




*** Check file sizes of included figures
#+begin_src sh
  grep 'Graphic file' ms.log | cut -d ' ' -f2 |xargs du -sk |sort -nr
#+end_src

#+RESULTS:
| 2112 | figs/oiii-propermotions-lores.jpg                      |
|  832 | figs/turtle-lobes-simplified-components-lores.jpg      |
|  832 | figs/nii-propermotions-lores.jpg                       |
|  792 | figs/turtle-lobes-simplified-systems.pdf               |
|  776 | figs/turtle-overview.pdf                               |
|  740 | figs/turtle-halo-slit-x.pdf                            |
|  544 | figs/turtle-halo-map-lores.jpg                         |
|  532 | figs/cut-axis-4panel.pdf                               |
|  392 | figs/turtle-heii-shell-components.pdf                  |
|  364 | tere-figs/Figure3.pdf                                  |
|  364 | figs/turtle-nii-knot-complexes.pdf                     |
|  224 | figs/turtle-peanut-map-lores.jpg                       |
|  180 | figs/cousins-of-the-turtle-lores.pdf                   |
|  176 | figs/turtle-knot-complex-map-lores.jpg                 |
|   76 | figs/turtle-knot-complexes-velocity-axes-annotated.pdf |
|   76 | figs/line-ratios-vs-ion-parameter.pdf                  |
|   68 | figs/turtle-heii-shell-annotated.pdf                   |
|   48 | tere-figs/Figure2a.pdf                                 |
|   48 | figs/vel-radius-systems-annotated.pdf                  |
|   48 | figs/turtle-shell-velocity-axes-annotated.pdf          |
|   44 | figs/hr-pne-annotated.pdf                              |
|   40 | figs/mass-loss-history-annotated.pdf                   |
|   32 | figs/turtle-density-profile.pdf                        |
|   32 | figs/turtle-density-calibration.pdf                    |
|   28 | figs/turtle-flow-axis-history.pdf                      |
|   24 | figs/turtle-heii-shell-velocity-axes-annotated.pdf     |
|   20 | figs/turtle-inclination-histogram.pdf                  |
  
